Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/RTC_old/RTC_old.tmx
Source language: en_us
Languages: de_de

source: 4. The divan of Claim 1, wherein the latch assembly of the panel door latch mechanism includes a spring-loaded pin sub-assembly, the spring-loaded pin sub-assembly includes a compressible spring and a spring-loaded pin (130), the spring-loaded pin configured to couple to at least one integrated frame member of the plurality of frame members on the panel door.
de_de: 4. Diwan nach Anspruch 1, wobei die Verschlussbaugruppe des Verschlussmechanismus der Paneeltür eine federbelastete Stiftunterbaugruppe aufweist, wobei die federbelastete Stiftunterbaugruppe eine komprimierbare Feder und einen federbelasteten Stift (130) aufweist, wobei der federbelastete Stift konfiguriert ist, um mit mindestens einem einstückigen Rahmenelement der Vielzahl von Rahmenelementen an die Paneeltür gekoppelt zu werden.

source: 5. The divan of Claim 4, wherein the door handle is configured to compress the compressible spring to cause the spring-loaded pin to disengage from a hole (139) on a portion of the closeout panel.
de_de: 5. Diwan nach Anspruch 4, wobei der Türgriff konfiguriert ist, um die komprimierbare Feder zu komprimieren, um den federbelasteten Stift zu veranlassen, sich aus einem Loch (139) an einem Abschnitt des Verkleidungspaneels zu entkoppeln.

source: 6. The divan of Claim 5, wherein at least one integrated frame member of the plurality of frame members includes a slot (132) configured to receive at least a portion of a fixed pin coupled to a portion of the closeout panel when the panel door is in the closed position, the fixed pin positioned proximate to the hole on the closeout panel.
de_de: 6. Diwan nach Anspruch 5, wobei mindestens ein einstückiges Rahmenelement der Vielzahl von Rahmenelementen einen Schlitz (132) aufweist, der konfiguriert ist, um mindestens einen Abschnitt eines fixierten Stifts aufzunehmen, der mit einem Abschnitt des Verkleidungspaneels gekoppelt ist, wenn die Paneeltür in der geschlossenen Position ist, wobei der fixierte Stift in der Nähe des Lochs an dem Verkleidungspaneel positioniert ist.

source: 7. The divan of any preceding Claim, wherein the storage compartment is configured to stow an inflatable life raft.
de_de: 7. Diwan nach einem der vorhergehenden Ansprüche, wobei das Staufach zum Verstauen eines aufblasbaren Rettungsfloßes konfiguriert ist.

source: 8. The divan of any preceding Claim, further comprising:
de_de: 8. Diwan nach einem der vorhergehenden Ansprüche, ferner umfassend:

source: at least one backrest cushion (108) configured to couple to a portion of the backrest frame.
de_de: mindestens ein Rückenlehnenpolster (108), das konfiguriert ist, um mit einem Abschnitt des Rückenlehnenrahmens gekoppelt zu werden.

source: 9. The divan of any preceding Claim, further comprising:
de_de: 9. Diwan nach einem der vorhergehenden Ansprüche, ferner umfassend:

source: at least one seat pan cushion (114) configured to couple to a portion of the seat pan frame.
de_de: mindestens ein Sitzflächenpolster (114), das konfiguriert ist, um mit einem Abschnitt des Sitzflächenrahmens gekoppelt zu werden.

source: Claims
de_de: Patentansprüche

source: 1. Aircraft beacon light (2), comprising:
de_de: 1. Luftfahrzeugleuchtfeuer (2), umfassend:

source: an annular light source support (6) having a plurality of light passing portions (6a) which extend through the annular light source support (6);
de_de: einen ringförmigen Lichtquellenträger (6) mit einer Vielzahl von Lichtdurchlassabschnitten (6a), die sich durch den ringförmigen Lichtquellenträger (6) erstrecken;

source: a plurality of light sources (4), arranged on the annular light source support (6) for a radially outwards emission of light flashes;
de_de: eine Vielzahl von Lichtquellen (4), die auf dem ringförmigen Lichtquellenträger (6) zur radial nach außen gerichteten Emission von Lichtblitzen angeordnet sind;

source: a light detector (10) for sensing a light output level of at least a subset of the plurality of light sources (4); and
de_de: einen Lichtdetektor (10) zum Erfassen eines Lichtausgangspegels von zumindest einer Teilmenge der Vielzahl von Lichtquellen (4); und

source: at least one optical element (20) for shaping a beacon light output from light emitted by the plurality of light sources (4), the at least one optical element (20) having at least one light guiding portion (20b) for capturing stray light (7) from at least said subset of the plurality of light sources (4) and for guiding said stray light (7) through the plurality of light passing portions and towards the light detector (10).
de_de: mindestens ein optisches Element (20) zum Formen eines Leuchtfeuerlichts aus dem von der Vielzahl von Lichtquellen (4) emittierten Licht, wobei das mindestens eine optische Element (20) mindestens einen Lichtleitabschnitt (20b) zum Auffangen von Streulicht (7) von mindestens der Teilmenge der Vielzahl von Lichtquellen (4) und zum Leiten des Streulichts (7) durch die Vielzahl von Lichtdurchlassabschnitten und in Richtung des Lichtdetektors (10) aufweist.

source: 2. Aircraft beacon light (2) according to claim 1,
de_de: 2. Luftfahrzeugleuchtfeuer (2) nach Anspruch 1,

source: wherein the light guiding portion (20b) comprises a total internal reflection portion, directing the stray light (7) towards the plurality of light passing portions (6a).
de_de: wobei der Lichtleitabschnitt (20b) einen Abschnitt mit totaler Innenreflexion umfasst, der das Streulicht (7) in Richtung der Vielzahl von Lichtdurchlassabschnitten (6a) lenkt.

source: 3. Aircraft beacon light (2) according to claim 1 or 2, wherein the at least one optical element (20) is a lens structure, in particular a unitary lens structure encasing the plurality of light sources (4).
de_de: 3. Luftfahrzeugleuchtfeuer (2) nach Anspruch 1 oder 2, wobei das mindestens eine optische Element (20) eine Linsenstruktur ist, insbesondere eine einheitliche Linsenstruktur, die die mehreren Lichtquellen (4) umschließt.

source: 4. Aircraft beacon light (2) according to any of the preceding claims, wherein each of the plurality of light passing portions (6a) has a one-to-one correspondence to each of the plurality of light sources (4).
de_de: 4. Luftfahrzeugleuchtfeuer (2) nach einem der vorhergehenden Ansprüche, wobei jeder der Vielzahl von Lichtdurchlassabschnitten (6a) eine Eins-zu-eins-Entsprechung zu jeder der Vielzahl von Lichtquellen (4) aufweist.

source: 5. Aircraft beacon light (2) according to any of the preceding claims, wherein each of the plurality of light passing portions (6a) comprises a plurality of through holes through the annular light source support (6).
de_de: 5. Luftfahrzeugleuchtfeuer (2) nach einem der vorhergehenden Ansprüche, wobei jeder der Vielzahl von Lichtdurchlassabschnitten (6a) eine Vielzahl von Durchgangslöchern durch den ringförmigen Lichtquellenträger (6) umfasst.

source: 6. Aircraft beacon light (2) according to claim 5, wherein the annular light source support (6) comprises at least one printed circuit board and wherein the plurality of through holes are vias through the at least one printed circuit board.
de_de: 6. Luftfahrzeugleuchtfeuer (2) nach Anspruch 5, wobei der ringförmige Lichtquellenträger (6) mindestens eine Leiterplatte umfasst und wobei die mehreren Durchgangslöcher Durchkontaktierungen durch die mindestens eine Leiterplatte sind.

source: 7. Aircraft beacon light (2) according to claim 5 or 6, wherein the plurality of through holes each have a diameter of less than 0.5 mm, in particular a diameter of between 0.2 mm and 0.4 mm.
de_de: 7. Luftfahrzeugleuchtfeuer (2) nach Anspruch 5 oder 6, wobei die Vielzahl von Durchgangslöchern jeweils einen Durchmesser von weniger als 0,5 mm, insbesondere einen Durchmesser zwischen 0,2 mm und 0,4 mm aufweisen.

source: 8. Aircraft beacon light (2) according to any of claims 1 to 4, wherein each of the plurality of light passing portions (6a) comprises a single through hole, in particular a single through hole having a diameter greater than 0.5 mm.
de_de: 8. Luftfahrzeugleuchtfeuer (2) nach einem der Ansprüche 1 bis 4, wobei jeder der mehreren Lichtdurchlassabschnitte (6a) ein einzelnes Durchgangsloch aufweist, insbesondere ein einzelnes Durchgangsloch mit einem Durchmesser von mehr als 0,5 mm.

source: 9. Aircraft beacon light (2) according to any of the preceding claims, wherein the plurality of light passing portions (6a) are filled with a filler material, such as silicone.
de_de: 9. Luftfahrzeugleuchtfeuer (2) nach einem der vorhergehenden Ansprüche, wobei die Vielzahl von Lichtdurchlassabschnitten (6a) mit einem Füllmaterial, wie beispielsweise Silikon, gefüllt sind.

source: Aircraft beacon light (2) according to any of the preceding claims, wherein the aircraft beacon light (2) further comprises a light redirecting element (30) for redirecting the stray light (7) from the plurality of light passing portions (6a) to the light detector (10).
de_de: Luftfahrzeugleuchtfeuer (2) nach einem der vorhergehenden Ansprüche, wobei das Luftfahrzeugleuchtfeuer (2) ferner ein Lichtumleitungselement (30) zum Umleiten des Streulichts (7) aus der Vielzahl von Lichtdurchlassabschnitten (6a) zu dem Lichtdetektor (10) umfasst.

source: Aircraft beacon light (2) according to claim 10, wherein the at least one optical element (20) and at least part of the light redirecting element (30) are formed in a joint molding operation, wherein the at least one optical element (20) and at least part of the light redirecting element (30) are in particular made from overmolded silicone.
de_de: Luftfahrzeugleuchtfeuer (2) nach Anspruch 10, wobei das mindestens eine optische Element (20) und mindestens ein Teil des Lichtumlenkelements (30) in einem gemeinsamen Formvorgang geformt sind, wobei das mindestens eine optische Element (20) und mindestens ein Teil des Lichtumlenkelements (30) insbesondere aus umspritztem Silikon bestehen.

source: Aircraft beacon light (2) according to claim 10 or 11, further comprising:
de_de: Luftfahrzeugleuchtfeuer (2) nach Anspruch 10 oder 11, ferner umfassend:

source: a housing (50) with a support plate (14) having a center hole (14a);
de_de: ein Gehäuse (50) mit einer Trägerplatte (14) mit einem Mittelloch (14a);

source: wherein the annular light source support (6) extends from the support plate (14);
de_de: wobei sich der ringförmige Lichtquellenträger (6) von der Trägerplatte (14) aus erstreckt;

source: wherein the light detector (10) is arranged within the housing (50); and
de_de: wobei der Lichtdetektor (10) innerhalb des Gehäuses (50) angeordnet ist; und

source: wherein the light redirecting element (30) is configured to guide said stray light from the plurality of light passing portions (6a) through the center hole (14a) of the support plate (14) and to the light detector (10).
de_de: wobei das Lichtumleitungselement (30) konfiguriert ist, um das Streulicht von der Vielzahl von Lichtdurchlassabschnitten (6a) durch das Mittelloch (14a) der Trägerplatte (14) zu dem Lichtdetektor (10) zu leiten.

source: Aircraft beacon light (2) according to claim 12,
de_de: Luftfahrzeugleuchtfeuer (2) nach Anspruch 12,

source: wherein the light redirecting element (30) is configured to effect a redirection by between 80° and 100° for guiding the stray light through the center hole (14a) of the support plate (14),
de_de: wobei das Lichtumlenkelement (30) konfiguriert ist, um eine Umlenkung zwischen 80° und 100° zu bewirken, um das Streulicht durch das Mittelloch (14a) der Trägerplatte (14) zu leiten,

source: wherein the light detector (10) is in particular arranged on a circuit board placed inside the housing (50) and wherein the light redirecting element (30) is further configured to effect a second redirection by between 80° and 100° for guiding the stray light to the light detector (10).
de_de: wobei der Lichtdetektor (10) insbesondere auf einer in dem Gehäuse (50) platzierten Leiterplatte angeordnet ist und wobei das Lichtumlenkelement (30) ferner konfiguriert ist, um eine zweite Umlenkung zwischen 80° und 100° zu bewirken, um das Streulicht zu dem Lichtdetektor (10) zu leiten.

source: Aircraft (100, 200), such as an air plane (100) or a rotorcraft (200), comprising at least one aircraft beacon light (2) according to any of the preceding claims, wherein the at least one aircraft beacon light (2) is in particular mounted to a top portion of the aircraft (100, 200) and/or to a bottom portion of the aircraft (100, 200).
de_de: Luftfahrzeug (100, 200), wie etwa ein Flugzeug (100) oder ein Drehflügler (200), umfassend mindestens ein Luftfahrzeugleuchtfeuer (2) nach einem der vorhergehenden Ansprüche, wobei das mindestens eine Luftfahrzeugleuchtfeuer (2) insbesondere an einem oberen Abschnitt des Luftfahrzeugs (100, 200) und/oder an einem unteren Abschnitt des Luftfahrzeugs (100, 200) angebracht ist.

source: Method of determining a health status of an aircraft beacon light (2) according to any of claims 1-13, the method comprising:
de_de: Verfahren zum Bestimmen eines Gesundheitszustands eines Luftfahrzeugleuchtfeuers (2) nach einem der Ansprüche 1–13, wobei das Verfahren Folgendes umfasst:

source: repeatedly emitting beacon light flashes from the plurality of light sources (4) and determining respective light output levels for the beacon light flashes from stray light (7) guided through the annular light source support (6) and to the light detector (10); and
de_de: wiederholte Emission von Leuchtfeuer-Lichtblitzen von der Vielzahl von Lichtquellen (4) und Bestimmen der jeweiligen Lichtausgangspegel für die Leuchtfeuer-Lichtblitze aus Streulicht (7), das durch den ringförmigen Lichtquellenträger (6) und zu dem Lichtdetektor (10) geleitet wird; und

source: on the basis of the light output levels over time, determining an aging status of the plurality of light sources (4).
de_de: und Bestimmen eines Alterungszustands der Vielzahl von Lichtquellen (4) basierend auf den Lichtausgangspegeln im Zeitverlauf.

source: 1. A turbine engine system (200), comprising:
de_de: 1. Turbinenmotorsystem (200), umfassend:

source: a core assembly comprising a compressor section (304; 404; 504; 604), a burner section (306; 406; 506; 606), and a turbine section (308; 408; 508; 608) arranged along a shaft (220), wherein a core flow path (316; 416; 516; 616) extends through the core assembly (304 … 606) such that exhaust from the burner section (306; … 606) passes through the turbine section (308; … 608) and exits through a nozzle (216);
de_de: eine Kernbaugruppe, die einen Kompressorabschnitt (304; 404; 504; 604), einen Brennerabschnitt (306; 406; 506; 606) und einen Turbinenabschnitt (308; 408; 508; 608) umfasst, die entlang einer Welle (220) angeordnet sind, wobei sich ein Kernströmungspfad (316; 416; 516; 616) durch die Kernbaugruppe (304 … 606) derart erstreckt, dass Abgas aus dem Brennerabschnitt (306; … 606) durch den Turbinenabschnitt (308; … 608) strömt und durch eine Düse (216) austritt;

source: a fuel cell (430; 530; 630) operably connected to the core assembly;
de_de: eine Brennstoffzelle (430; 530; 630), die betreibbar mit der Kernbaugruppe verbunden ist;

source: a fuel source (310; 410; 510; 610) configured to supply a fuel to each of the burner section (306; … 606) for combustion and the fuel cell (430; 530; 630) for reaction to generate electricity; and
de_de: eine Brennstoffquelle (310; 410; 510; 610), die konfiguriert ist, um dem Brennerabschnitt (306; … 606) zur Verbrennung und der Brennstoffzelle (430; 530; 630) zur Reaktion, um Strom zu erzeugen, jeweils einen Brennstoff zuzuführen; und

source: at least one electric motor (432, 434; 532, 534; 632, 634) operably coupled to the core assembly and configured to impart power to a portion of the core assembly, wherein the fuel cell (430; 530; 630) is configured to supply electrical power to the at least one electric motor (432; ... 634),
de_de: mindestens einen Elektromotor (432, 434; 532, 534; 632, 634), der mit der Kernbaugruppe wirkgekoppelt ist und konfiguriert ist, um einen Teil der Kernbaugruppe mit Strom zu versorgen, wobei die Brennstoffzelle (430; 530; 630) konfiguriert ist, um dem mindestens einen Elektromotor (432; ... 634) elektrische Energie zuzuführen,

source: characterized in that:
de_de: dadurch gekennzeichnet, dass:

source: the turbine engine system (200) comprises a core condenser (320; 420; 520; 620) arranged downstream of the turbine section (308; … 608) of the core assembly along the core flow path (316; … 616) and upstream of the nozzle, the core condenser (320; … 620) configured to condense water from the core flow path (316; … 616); and
de_de: das Turbinenmotorsystem (200) einen Kernkondensator (320; 420; 520; 620) umfasst, der dem Turbinenabschnitt (308; … 608) der Kernbaugruppe nachgelagert entlang des Kernströmungspfads (316; … 616) und der Düse vorgelagert angeordnet ist, wobei der Kernkondensator (320; … 620) konfiguriert ist, um Wasser aus dem Kernströmungspfad (316; … 616) zu kondensieren; und

source: the fuel cell (430; 530; 630) is thermally coupled to the core condenser (420; 520; 620).
de_de: die Brennstoffzelle (430; 530; 630) thermisch mit dem Kernkondensator (420; 520; 620) gekoppelt ist.

source: 2. The turbine engine system (200) of claim 1, wherein a thermal coupling of the fuel cell (430; 530; 630) to the core condenser (420; 520; 620) comprises:
de_de: 2. Turbinenmotorsystem (200) nach Anspruch 1, wobei eine thermische Kopplung der Brennstoffzelle (430; 530; 630) mit dem Kernkondensator (420; 520; 620) umfasst:

source: mounting at least a portion of the fuel cell (430; 530; 630) to the core condenser (420; 520; 620); or
de_de: Befestigen von mindestens einem Teil der Brennstoffzelle (430; 530; 630) an dem Kernkondensator (420; 520; 620); oder

source: a closed-loop cooling cycle thermally connecting the fuel cell (430; 530; 630) to the core condenser (320; 420; 520; 620).
de_de: einen geschlossenen Kühlkreislauf, der die Brennstoffzelle (430; 530; 630) thermisch mit dem Kernkondensator (320; 420; 520; 620) verbindet.

source: 3. The turbine engine system (200) of claim 1, wherein a thermal coupling of the fuel cell (430; 530; 630) to the core condenser (320; 420; 520; 620) comprises directing water from the collected water through the core condenser (420) and into a cooling element (442) of the fuel cell (430), optionally wherein:
de_de: 3. Turbinenmotorsystem (200) nach Anspruch 1, wobei eine thermische Kopplung der Brennstoffzelle (430; 530; 630) mit dem Kernkondensator (320; 420; 520; 620) das Leiten von Wasser aus dem gesammelten Wasser durch den Kernkondensator (420) und in ein Kühlelement (442) der Brennstoffzelle (430) umfasst, wobei optional:

source: the cooling element (442) is a cold plate thermally coupled to the fuel cell (430).
de_de: das Kühlelement (442) eine Kühlplatte ist, die thermisch mit der Brennstoffzelle (430) gekoppelt ist.

source: 4. The turbine engine system (200) of any preceding claim, wherein compressed air is directed from the compressor section (304; … 604) to the fuel cell (430; 530; 630) to provide at least one of air cooling or reactant air to the fuel cell (430; 530; 630).
de_de: 4. Turbinenmotorsystem (200) nach einem der vorhergehenden Ansprüche, wobei Druckluft von dem Kompressorabschnitt (304; … 604) zu der Brennstoffzelle (430; 530; 630) geleitet wird, um der Brennstoffzelle (430; 530; 630) Luftkühlung und/oder Reaktionsluft bereitzustellen.

source: 5. The turbine engine system (200) of any preceding claim, wherein the at least one electric motor (432; … 634) is operably coupled to at least one of the compressor section (304; … 604) or a shaft (220) of the core assembly to provide power thereto.
de_de: 5. Turbinenmotorsystem (200) nach einem der vorhergehenden Ansprüche, wobei der mindestens eine Elektromotor (432; … 634) mit dem Kompressorabschnitt (304; … 604) und/oder einer Welle (220) der Kernbaugruppe wirkgekoppelt ist, um dieser Leistung bereitzustellen.

source: 6. The turbine engine system (200) of any preceding claim, further comprising a fan section (302; … 602) at an inlet (202) of the core assembly, optionally wherein the at least one electric motor (432; … 634) is operably coupled to the fan section (302; … 602) to provide power thereto.
de_de: 6. Turbinenmotorsystem (200) nach einem der vorhergehenden Ansprüche, das ferner einen Gebläseabschnitt (302; … 602) an einem Einlass (202) der Kernbaugruppe umfasst, wobei optional der mindestens eine Elektromotor (432; … 634) mit dem Gebläseabschnitt (302; … 602) wirkgekoppelt ist, um diesem Leistung bereitzustellen.

source: 7. The turbine engine system (200) of any preceding claim, wherein each of the core condenser (320; … 620) and the fuel cell (430; 530; 630) are configured to output water to be injected into the core flow path (316; … 616), the turbine engine system (200) optionally further comprising a water tank (322; 422; 522; 622) configured to receive the output water from the core condenser (320; … 620) and the fuel cell (430; 530; 630).
de_de: 7. Turbinenmotorsystem (200) nach einem der vorhergehenden Ansprüche, wobei der Kernkondensator (320; … 620) und die Brennstoffzelle (430; 530; 630) jeweils konfiguriert sind, um in den Kernströmungspfad (316; … 616) einzuspritzendes Wasser abzugeben, wobei das Turbinenmotorsystem (200) optional ferner einen Wassertank (322; 422; 522; 622) umfasst, der konfiguriert ist, um das abgegebene Wasser von dem Kernkondensator (320; … 620) und der Brennstoffzelle (430; 530; 630) aufzunehmen.

source: 8. The turbine engine system (200) of any preceding claim, further comprising a core flow evaporator (328; 428; 528; 628) arranged downstream from the turbine section (308; … 608) and upstream from the core condenser (320; … 620) along the core flow path (316; … 616), the core flow evaporator (328; … 628) configured to generate steam from water output from at least one of the core condenser (320… 620) and the fuel cell (430; 530; 630).
de_de: 8. Turbinenmotorsystem (200) nach einem der vorhergehenden Ansprüche, ferner umfassend einen Kernstromverdampfer (328; 428; 528; 628), der dem Turbinenabschnitt (308; … 608) nachgelagert und dem Kernkondensator (320; … 620) vorgelagert entlang des Kernströmungspfads (316; … 616) angeordnet ist, wobei der Kernstromverdampfer (328; … 628) konfiguriert ist, um aus dem von dem Kernkondensator (320 … 620) und/oder der Brennstoffzelle (430; 530; 630) abgegebenen Wasser Dampf zu erzeugen.

source: 9. The turbine engine system (200) of any preceding claim, further comprising a controller (444) configured to control operation of at least the fuel cell (430; 530; 630), the controller (444) configured to operate the fuel cell (430; 530; 630) when the core assembly is in an idle mode of operation.
de_de: 9. Turbinenmotorsystem (200) nach einem der vorhergehenden Ansprüche, das ferner eine Steuerung (444) umfasst, die konfiguriert ist, um den Betrieb von mindestens der Brennstoffzelle (430; 530; 630) zu steuern, wobei die Steuerung (444) konfiguriert ist, um die Brennstoffzelle (430; 530; 630) zu betreiben, wenn die Kernbaugruppe in einem Leerlaufbetriebsmodus ist.

source: A method of operating a turbine engine system (200), the turbine engine system (200) comprising a core assembly and a fuel cell (430; 530; 630), the method comprising:
de_de: Verfahren zum Betreiben eines Turbinenmotorsystems (200), wobei das Turbinenmotorsystem (200) eine Kernbaugruppe und eine Brennstoffzelle (430; 530; 630) umfasst, das Verfahren umfassend:
